In [1]:
import pandas as pd

stats = pd.read_csv('../data/Birth-Internet-Income-Per-Country.csv')

# Exploring Dataframes

In [2]:
stats

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [3]:
# Give the columns names without spaces
stats.columns = [ 'CountryName', 'CountryCode', 'BirthRate', 'InternetUsers', 'IncomeGroup' ]
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

### len()

In [4]:
len( stats )

195

### Columns

In [5]:
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

### Number of Columns

In [6]:
len( stats.columns )

5

### Head and Tail

In [7]:
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [8]:
stats.head( 8 )

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
5,Argentina,ARG,17.716,59.9,High income
6,Armenia,ARM,13.308,41.9,Lower middle income
7,Antigua and Barbuda,ATG,16.447,63.4,High income

In [9]:
stats[ 20:100 ].head( 7 )

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
20,Belarus,BLR,12.500,54.17,Upper middle income
21,Belize,BLZ,23.092,33.60,Upper middle income
22,Bermuda,BMU,10.400,95.30,High income
23,Bolivia,BOL,24.236,36.94,Lower middle income
24,Brazil,BRA,14.931,51.04,Upper middle income
25,Barbados,BRB,12.188,73.00,High income
26,Brunei Darussalam,BRN,16.405,64.50,High income

In [10]:
stats.tail()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

### info()

In [11]:
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CountryName    195 non-null    object
 1   CountryCode    195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

### describe()

Looks at all numeric fields and gives statistical analysis across all observations.

In [12]:
stats.describe()

        BirthRate  InternetUsers
count  195.000000     195.000000
mean    21.469928      42.076471
std     10.605467      29.030788
min      7.900000       0.900000
25%     12.120500      14.520000
50%     19.680000      41.000000
75%     29.759500      66.225000
max     49.661000      96.546800

In [13]:
stats.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
BirthRate,195.0,21.469928,10.605467,7.9,12.1205,19.68,29.7595,49.6610
InternetUsers,195.0,42.076471,29.030788,0.9,14.5200,41.00,66.2250,96.5468

### Unqiue Categorical Values

In [14]:
stats.IncomeGroup.unique()

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

# Slicing / Filtering Dataframes

### Accessing a Single Column

In [15]:
stats.CountryName

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: CountryName, Length: 195, dtype: object

In [16]:
stats[ 'CountryName' ]

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: CountryName, Length: 195, dtype: object

### Accessing a Subset of Rows

In [17]:
stats[0:5]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [18]:
stats[0:100:10]

   CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0        Aruba         ABW     10.244      78.900000          High income
10  Azerbaijan         AZE     18.300      58.700000  Upper middle income
20     Belarus         BLR     12.500      54.170000  Upper middle income
30      Canada         CAN     10.900      85.800000          High income
40  Costa Rica         CRI     15.022      45.960000  Upper middle income
50     Ecuador         ECU     21.070      40.353684  Upper middle income
60       Gabon         GAB     30.555       9.200000  Upper middle income
70   Greenland         GRL     14.500      65.800000          High income
80       India         IND     20.291      15.100000  Lower middle income
90  Kazakhstan         KAZ     22.730      54.000000  Upper middle income

### Accessing a Subset of Columns

In [19]:
columns = [ 'CountryName', 'CountryCode' ]
stats[ columns ]

              CountryName CountryCode
0                   Aruba         ABW
1             Afghanistan         AFG
2                  Angola         AGO
3                 Albania         ALB
4    United Arab Emirates         ARE
..                    ...         ...
190           Yemen, Rep.         YEM
191          South Africa         ZAF
192      Congo, Dem. Rep.         COD
193                Zambia         ZMB
194              Zimbabwe         ZWE

[195 rows x 2 columns]

In [20]:
stats[ [ 'CountryName', 'CountryCode' ] ]

              CountryName CountryCode
0                   Aruba         ABW
1             Afghanistan         AFG
2                  Angola         AGO
3                 Albania         ALB
4    United Arab Emirates         ARE
..                    ...         ...
190           Yemen, Rep.         YEM
191          South Africa         ZAF
192      Congo, Dem. Rep.         COD
193                Zambia         ZMB
194              Zimbabwe         ZWE

[195 rows x 2 columns]

### Slicing Rows and Columns

In [21]:
stats[ [ 'CountryName', 'CountryCode' ] ][ 0:5 ]

            CountryName CountryCode
0                 Aruba         ABW
1           Afghanistan         AFG
2                Angola         AGO
3               Albania         ALB
4  United Arab Emirates         ARE

In [22]:
stats[ 0:5 ][ [ 'CountryName', 'CountryCode' ] ]

            CountryName CountryCode
0                 Aruba         ABW
1           Afghanistan         AFG
2                Angola         AGO
3               Albania         ALB
4  United Arab Emirates         ARE

### Filtering Rows

In [23]:
filter = stats.InternetUsers < 10
filter.head()

0    False
1     True
2    False
3    False
4    False
Name: InternetUsers, dtype: bool

In [24]:
# Pass in a frame of booleans that will be used to filter out the results
filter = stats.InternetUsers < 10
stats[ filter ].head()

     CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
1    Afghanistan         AFG     35.253           5.90           Low income
11       Burundi         BDI     44.151           1.30           Low income
13         Benin         BEN     36.440           4.90           Low income
14  Burkina Faso         BFA     40.551           9.10           Low income
15    Bangladesh         BGD     20.142           6.63  Lower middle income

In [25]:
# Pass in a frame of booleans that will be used to filter out the results
stats[ stats.InternetUsers < 10 ].head()

     CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
1    Afghanistan         AFG     35.253           5.90           Low income
11       Burundi         BDI     44.151           1.30           Low income
13         Benin         BEN     36.440           4.90           Low income
14  Burkina Faso         BFA     40.551           9.10           Low income
15    Bangladesh         BGD     20.142           6.63  Lower middle income

In [26]:
# Have to use the elementwise `&` and not `and`
stats[ ( stats.InternetUsers < 10 ) & ( stats.BirthRate > 40 ) ].head()

      CountryName CountryCode  BirthRate  InternetUsers IncomeGroup
11        Burundi         BDI     44.151            1.3  Low income
14   Burkina Faso         BFA     40.551            9.1  Low income
115          Mali         MLI     44.138            3.5  Low income
127         Niger         NER     49.661            1.7  Low income
156       Somalia         SOM     43.891            1.5  Low income

In [27]:
stats[ stats.CountryName == 'Mali' ]

    CountryName CountryCode  BirthRate  InternetUsers IncomeGroup
115        Mali         MLI     44.138            3.5  Low income

### at() and iat()

In [28]:
stats[::10].head()

   CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0        Aruba         ABW     10.244          78.90          High income
10  Azerbaijan         AZE     18.300          58.70  Upper middle income
20     Belarus         BLR     12.500          54.17  Upper middle income
30      Canada         CAN     10.900          85.80          High income
40  Costa Rica         CRI     15.022          45.96  Upper middle income

In [29]:
stats[::10].iat[ 1, 1 ]

'AZE'

In [30]:
stats[::10].at[ 30, 'BirthRate' ]

10.9

# Modifying Dataframes

### Renaming Columns

In [31]:
stats.columns = [ 'CountryName', 'CountryCode', 'BirthRate', 'InternetUsers', 'IncomeGroup' ]
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

### Adding a Column

In [32]:
stats[ 'MyNewColumn' ] = stats.BirthRate * stats.InternetUsers
stats[ 'MyNewColumn2' ] = stats.BirthRate * 5
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup,MyNewColumn,MyNewColumn2
0,Aruba,ABW,10.244,78.9,High income,808.2516,51.220
1,Afghanistan,AFG,35.253,5.9,Low income,207.9927,176.265
2,Angola,AGO,45.985,19.1,Upper middle income,878.3135,229.925
3,Albania,ALB,12.877,57.2,Upper middle income,736.5644,64.385
4,United Arab Emirates,ARE,11.044,88.0,High income,971.8720,55.220

### Removing a Column

In [33]:
# axis=1 means the columns
stats = stats.drop( 'MyNewColumn', axis=1 )
stats = stats.drop( 'MyNewColumn2', axis=1 )
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

### Converting a Column Type to Categorical

In [34]:
movies = pd.read_csv('../data/Movie-Ratings.csv')
movies.columns = [ 'Film', 'Genre', 'CriticRating', 'AudienceRating', 'Budget', 'Year' ]

movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Film            559 non-null    object
 1   Genre           559 non-null    object
 2   CriticRating    559 non-null    int64
 3   AudienceRating  559 non-null    int64
 4   Budget          559 non-null    int64
 5   Year            559 non-null    int64
dtypes: int64(4), object(2)
memory usage: 26.3+ KB

In [35]:
# Year shows up because it is an int64
movies.describe()

       CriticRating  AudienceRating      Budget         Year
count    559.000000      559.000000  559.000000   559.000000
mean      47.309481       58.744186   50.236136  2009.152057
std       26.413091       16.826887   48.731817     1.362632
min        0.000000        0.000000    0.000000  2007.000000
25%       25.000000       47.000000   20.000000  2008.000000
50%       46.000000       58.000000   35.000000  2009.000000
75%       70.000000       72.000000   65.000000  2010.000000
max       97.000000       96.000000  300.000000  2011.000000

In [36]:
print( movies.Genre.unique() )
print( movies.Year.unique() )

['Comedy' 'Adventure' 'Action' 'Horror' 'Drama' 'Romance' 'Thriller']
[2009 2008 2010 2007 2011]

In [37]:
movies.Film = movies.Film.astype( 'category' )
movies.Genre = movies.Genre.astype( 'category' )
movies.Year = movies.Year.astype( 'category' )

In [38]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Film            559 non-null    category
 1   Genre           559 non-null    category
 2   CriticRating    559 non-null    int64
 3   AudienceRating  559 non-null    int64
 4   Budget          559 non-null    int64
 5   Year            559 non-null    category
dtypes: category(3), int64(3)
memory usage: 40.3 KB

In [39]:
# Get all the unique category values
movies.Genre.cat.categories

Index(['Action', 'Adventure', 'Comedy', 'Drama', 'Horror', 'Romance',
       'Thriller'],
      dtype='object')

In [40]:
# Year will no longer show up because it is now a category
movies.describe()

       CriticRating  AudienceRating      Budget
count    559.000000      559.000000  559.000000
mean      47.309481       58.744186   50.236136
std       26.413091       16.826887   48.731817
min        0.000000        0.000000    0.000000
25%       25.000000       47.000000   20.000000
50%       46.000000       58.000000   35.000000
75%       70.000000       72.000000   65.000000
max       97.000000       96.000000  300.000000

# Functions

### read_csv

Reads a csv file into a dataframe.

In [41]:
stats = pd.read_csv('../data/Birth-Internet-Income-Per-Country.csv')
stats

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income